{
  "patch_size": [
    1,
    2,
    2
  ],
  "num_attention_heads": 24,
  "attention_head_dim": 128,
  "in_channels": 48,
  "out_channels": 48,
  "action_dim": 30,
  "text_dim": 4096,
  "freq_dim": 256,
  "ffn_dim": 14336,
  "num_layers": 30,
  "cross_attn_norm": true,
  "eps": 1e-06,
  "rope_max_seq_len": 1024,
  "pos_embed_seq_len": null,
  "attn_mode": "flex",
  "_class_name": "WanTransformer3DModel",
  "_diffusers_version": "0.35.0.dev0"
}